LeZelote01/SecureIoT-VIF/components/secure_element/esp32_crypto_manager.c
/**
 * @file esp32_crypto_manager.c
 * @brief Implémentation du gestionnaire cryptographique ESP32 intégré
 * 
 * @author Framework SecureIoT-VIF
 * @version 2.0.0 - ESP32 Crypto Intégré
 * @date 2025
 */

#include "esp32_crypto_manager.h"
#include "app_config.h"

#include <string.h>
#include <stdio.h>
#include <stdlib.h>

#include "esp_log.h"
#include "esp_err.h"
#include "esp_system.h"
#include "esp_mac.h"
#include "esp_efuse.h"
#include "esp_efuse_table.h"
#include "esp_secure_boot.h"
#include "esp_flash_encrypt.h"
#include "nvs_flash.h"
#include "nvs.h"

#include "mbedtls/entropy.h"
#include "mbedtls/ctr_drbg.h"
#include "mbedtls/ecdsa.h"
#include "mbedtls/ecp.h"
#include "mbedtls/sha256.h"
#include "mbedtls/aes.h"
#include "mbedtls/md.h"

static const char *TAG = "ESP32_CRYPTO";

// ================================
// Variables globales statiques
// ================================

static bool g_crypto_initialized = false;
static esp32_crypto_config_t g_crypto_config;
static esp32_crypto_info_t g_crypto_info;
static uint32_t g_operation_counter = 0;
static uint32_t g_error_counter = 0;

// Contextes crypto mbedTLS
static mbedtls_entropy_context g_entropy;
static mbedtls_ctr_drbg_context g_ctr_drbg;
static bool g_entropy_initialized = false;

// Clés stockées en mémoire (publiques uniquement)
static esp32_key_info_t g_key_slots[4];
static bool g_keys_initialized = false;

// ================================
// Fonctions utilitaires privées
// ================================

/**
 * @brief Initialise le générateur d'entropie
 */
static esp_err_t init_entropy_context(void) {
    if (g_entropy_initialized) {
        return ESP_OK;
    }
    
    ESP_LOGI(TAG, "Initialisation contexte entropie...");
    
    mbedtls_entropy_init(&g_entropy);
    mbedtls_ctr_drbg_init(&g_ctr_drbg);
    
    const char *personalization = "SecureIoT-VIF-ESP32";
    int ret = mbedtls_ctr_drbg_seed(&g_ctr_drbg, mbedtls_entropy_func, &g_entropy,
                                    (const unsigned char *)personalization,
                                    strlen(personalization));
    
    if (ret != 0) {
        ESP_LOGE(TAG, "Échec initialisation DRBG: -0x%04x", -ret);
        return ESP_FAIL;
    }
    
    g_entropy_initialized = true;
    ESP_LOGI(TAG, "Contexte entropie initialisé avec succès");
    return ESP_OK;
}

/**
 * @brief Nettoie le contexte d'entropie
 */
static void cleanup_entropy_context(void) {
    if (g_entropy_initialized) {
        mbedtls_ctr_drbg_free(&g_ctr_drbg);
        mbedtls_entropy_free(&g_entropy);
        g_entropy_initialized = false;
        ESP_LOGI(TAG, "Contexte entropie nettoyé");
    }
}

/**
 * @brief Initialise les informations du dispositif
 */
static esp_err_t init_device_info(void) {
    ESP_LOGI(TAG, "Initialisation informations dispositif...");
    
    // Obtenir l'ID unique (MAC address)
    esp_err_t ret = esp_read_mac(g_crypto_info.device_id, ESP_MAC_WIFI_STA);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Échec lecture MAC: %s", esp_err_to_name(ret));
        return ret;
    }
    
    // Obtenir la révision du chip
    esp_chip_info_t chip_info;
    esp_chip_info(&chip_info);
    g_crypto_info.chip_revision = chip_info.revision;
    
    // Vérifier l'état du Secure Boot
    g_crypto_info.secure_boot_enabled = esp_secure_boot_enabled();
    
    // Vérifier l'état du chiffrement flash
    g_crypto_info.flash_encryption_enabled = esp_flash_encryption_enabled();
    
    // Initialiser les compteurs
    g_crypto_info.error_count = 0;
    g_crypto_info.operation_count = 0;
    g_crypto_info.last_operation_time = esp_timer_get_time();
    g_crypto_info.available_entropy = ESP32_TRNG_ENTROPY_THRESHOLD;
    g_crypto_info.state = ESP32_CRYPTO_STATE_CONFIGURED;
    
    ESP_LOGI(TAG, "Device ID: %02X:%02X:%02X:%02X:%02X:%02X",
             g_crypto_info.device_id[0], g_crypto_info.device_id[1], g_crypto_info.device_id[2],
             g_crypto_info.device_id[3], g_crypto_info.device_id[4], g_crypto_info.device_id[5]);
    ESP_LOGI(TAG, "Chip Revision: %d", g_crypto_info.chip_revision);
    ESP_LOGI(TAG, "Secure Boot: %s", g_crypto_info.secure_boot_enabled ? "Activé" : "Désactivé");
    ESP_LOGI(TAG, "Flash Encryption: %s", g_crypto_info.flash_encryption_enabled ? "Activé" : "Désactivé");
    
    return ESP_OK;
}

/**
 * @brief Initialise les slots de clés
 */
static esp_err_t init_key_slots(void) {
    ESP_LOGI(TAG, "Initialisation slots de clés...");
    
    for (int i = 0; i < 4; i++) {
        g_key_slots[i].key_id = i;
        g_key_slots[i].key_type = 0; // Non défini
        g_key_slots[i].key_size = 0;
        g_key_slots[i].is_in_efuse = false;
        g_key_slots[i].is_protected = false;
        g_key_slots[i].usage_count = 0;
        g_key_slots[i].efuse_block = i;
        memset(g_key_slots[i].key_data, 0, sizeof(g_key_slots[i].key_data));
    }
    
    g_keys_initialized = true;
    ESP_LOGI(TAG, "Slots de clés initialisés");
    return ESP_OK;
}

// ================================
// Fonctions publiques
// ================================

esp_err_t esp32_crypto_manager_init(const esp32_crypto_config_t* config) {
    if (g_crypto_initialized) {
        ESP_LOGW(TAG, "Gestionnaire crypto déjà initialisé");
        return ESP_OK;
    }
    
    ESP_LOGI(TAG, "=== Initialisation Gestionnaire Crypto ESP32 ===");
    
    // Configuration par défaut si NULL
    if (config == NULL) {
        g_crypto_config.enable_secure_boot = ESP32_SECURE_BOOT_V2_ENABLED;
        g_crypto_config.enable_flash_encryption = ESP32_FLASH_ENCRYPTION_ENABLED;
        g_crypto_config.enable_hardware_random = true;
        g_crypto_config.enable_efuse_protection = ESP32_EFUSE_PROTECTION_ENABLED;
        g_crypto_config.entropy_source = 1;
        g_crypto_config.rsa_key_size = RSA_KEY_SIZE_BITS;
        g_crypto_config.enable_debug_mode = false;
        g_crypto_config.max_retries = 3;
    } else {
        memcpy(&g_crypto_config, config, sizeof(esp32_crypto_config_t));
    }
    
    ESP_LOGI(TAG, "Configuration:");
    ESP_LOGI(TAG, "  - Secure Boot: %s", g_crypto_config.enable_secure_boot ? "Activé" : "Désactivé");
    ESP_LOGI(TAG, "  - Flash Encryption: %s", g_crypto_config.enable_flash_encryption ? "Activé" : "Désactivé");
    ESP_LOGI(TAG, "  - Hardware Random: %s", g_crypto_config.enable_hardware_random ? "Activé" : "Désactivé");
    ESP_LOGI(TAG, "  - RSA Key Size: %d bits", g_crypto_config.rsa_key_size);
    
    // Initialiser NVS pour stockage sécurisé
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
    
    // Initialiser le contexte d'entropie
    ret = init_entropy_context();
    if (ret != ESP_OK) {
        return ret;
    }
    
