LeZelote01/SecureIoT-VIF/components/secure_element/esp32_crypto_manager.c
    // Initialiser les informations du dispositif
    ret = init_device_info();
    if (ret != ESP_OK) {
        cleanup_entropy_context();
        return ret;
    }
    
    // Initialiser les slots de clés
    ret = init_key_slots();
    if (ret != ESP_OK) {
        cleanup_entropy_context();
        return ret;
    }
    
    g_crypto_initialized = true;
    g_crypto_info.state = ESP32_CRYPTO_STATE_CONFIGURED;
    
    ESP_LOGI(TAG, "=== Gestionnaire Crypto ESP32 Initialisé avec Succès ===");
    return ESP_OK;
}

esp_err_t esp32_crypto_manager_deinit(void) {
    if (!g_crypto_initialized) {
        return ESP_OK;
    }
    
    ESP_LOGI(TAG, "Dé-initialisation gestionnaire crypto ESP32...");
    
    // Nettoyer les contextes crypto
    cleanup_entropy_context();
    
    // Réinitialiser les états
    g_crypto_initialized = false;
    g_keys_initialized = false;
    g_crypto_info.state = ESP32_CRYPTO_STATE_UNINITIALIZED;
    
    ESP_LOGI(TAG, "Gestionnaire crypto ESP32 dé-initialisé");
    return ESP_OK;
}

esp32_crypto_result_t esp32_crypto_get_device_info(esp32_crypto_info_t* info) {
    if (!g_crypto_initialized || info == NULL) {
        return ESP32_CRYPTO_ERROR_NOT_INITIALIZED;
    }
    
    memcpy(info, &g_crypto_info, sizeof(esp32_crypto_info_t));
    return ESP32_CRYPTO_SUCCESS;
}

esp32_crypto_result_t esp32_crypto_health_check(void) {
    if (!g_crypto_initialized) {
        return ESP32_CRYPTO_ERROR_NOT_INITIALIZED;
    }
    
    ESP_LOGD(TAG, "Vérification santé crypto ESP32...");
    
    // Test du générateur aléatoire
    uint8_t test_random[16];
    esp32_crypto_result_t result = esp32_crypto_generate_random(test_random, sizeof(test_random));
    if (result != ESP32_CRYPTO_SUCCESS) {
        ESP_LOGE(TAG, "Échec test générateur aléatoire");
        g_crypto_info.error_count++;
        return ESP32_CRYPTO_ERROR_ENTROPY_FAILED;
    }
    
    // Test de hash SHA-256
    uint8_t test_data[] = "SecureIoT-VIF Test";
    uint8_t test_hash[32];
    result = esp32_crypto_sha256(test_data, strlen((char*)test_data), test_hash);
    if (result != ESP32_CRYPTO_SUCCESS) {
        ESP_LOGE(TAG, "Échec test SHA-256");
        g_crypto_info.error_count++;
        return ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
    }
    
    ESP_LOGI(TAG, "Vérification santé crypto réussie");
    return ESP32_CRYPTO_SUCCESS;
}

esp32_crypto_result_t esp32_crypto_generate_ecdsa_keypair(uint8_t key_id, uint8_t* public_key) {
    if (!g_crypto_initialized || !g_entropy_initialized || key_id >= 4 || public_key == NULL) {
        return ESP32_CRYPTO_ERROR_INVALID_PARAM;
    }
    
    ESP_LOGI(TAG, "Génération paire de clés ECDSA pour slot %d...", key_id);
    
    mbedtls_ecp_group grp;
    mbedtls_mpi d;
    mbedtls_ecp_point Q;
    
    mbedtls_ecp_group_init(&grp);
    mbedtls_mpi_init(&d);
    mbedtls_ecp_point_init(&Q);
    
    esp32_crypto_result_t result = ESP32_CRYPTO_SUCCESS;
    
    do {
        // Initialiser la courbe P-256
        int ret = mbedtls_ecp_group_load(&grp, MBEDTLS_ECP_DP_SECP256R1);
        if (ret != 0) {
            ESP_LOGE(TAG, "Échec chargement courbe P-256: -0x%04x", -ret);
            result = ESP32_CRYPTO_ERROR_KEY_GENERATION;
            break;
        }
        
        // Générer la clé privée
        ret = mbedtls_ecp_gen_keypair(&grp, &d, &Q, mbedtls_ctr_drbg_random, &g_ctr_drbg);
        if (ret != 0) {
            ESP_LOGE(TAG, "Échec génération paire de clés: -0x%04x", -ret);
            result = ESP32_CRYPTO_ERROR_KEY_GENERATION;
            break;
        }
        
        // Exporter la clé publique (format non compressé)
        size_t olen;
        ret = mbedtls_ecp_point_write_binary(&grp, &Q, MBEDTLS_ECP_PF_UNCOMPRESSED,
                                             &olen, public_key, ESP32_PUBLIC_KEY_SIZE);
        if (ret != 0 || olen != 65) { // 1 + 32 + 32 bytes
            ESP_LOGE(TAG, "Échec export clé publique: -0x%04x", -ret);
            result = ESP32_CRYPTO_ERROR_KEY_GENERATION;
            break;
        }
        
        // Stocker les métadonnées de la clé (clé publique uniquement)
        g_key_slots[key_id].key_type = 1; // ECDSA
        g_key_slots[key_id].key_size = ESP32_PUBLIC_KEY_SIZE;
        memcpy(g_key_slots[key_id].key_data, public_key + 1, 64); // Skip first byte (0x04)
        g_key_slots[key_id].is_in_efuse = true; // Simulé
        g_key_slots[key_id].is_protected = true;
        g_key_slots[key_id].usage_count = 0;
        
        ESP_LOGI(TAG, "Paire de clés ECDSA générée pour slot %d", key_id);
        g_crypto_info.operation_count++;
        g_operation_counter++;
        
    } while (0);
    
    // Nettoyer (important: la clé privée ne doit pas rester en mémoire)
    mbedtls_ecp_point_free(&Q);
    mbedtls_mpi_free(&d);
    mbedtls_ecp_group_free(&grp);
    
    g_crypto_info.last_operation_time = esp_timer_get_time();
    return result;
}

esp32_crypto_result_t esp32_crypto_get_public_key(uint8_t key_id, uint8_t* public_key) {
    if (!g_crypto_initialized || key_id >= 4 || public_key == NULL) {
        return ESP32_CRYPTO_ERROR_INVALID_PARAM;
    }
    
    if (!g_key_slots[key_id].is_in_efuse || g_key_slots[key_id].key_type != 1) {
        ESP_LOGE(TAG, "Clé %d non disponible ou mauvais type", key_id);
        return ESP32_CRYPTO_ERROR_INVALID_PARAM;
    }
    
    // Format: 0x04 (uncompressed) + X (32 bytes) + Y (32 bytes)
    public_key[0] = 0x04;
    memcpy(public_key + 1, g_key_slots[key_id].key_data, 64);
    
    ESP_LOGD(TAG, "Clé publique récupérée pour slot %d", key_id);
    g_crypto_info.operation_count++;
    g_crypto_info.last_operation_time = esp_timer_get_time();
    
    return ESP32_CRYPTO_SUCCESS;
}

esp32_crypto_result_t esp32_crypto_generate_random(uint8_t* random_bytes, size_t length) {
    if (!g_crypto_initialized || random_bytes == NULL || length == 0 || length > 1024) {
        return ESP32_CRYPTO_ERROR_INVALID_PARAM;
    }
    
    ESP_LOGD(TAG, "Génération %zu bytes aléatoires...", length);
    
    if (g_crypto_config.enable_hardware_random) {
        // Utiliser le TRNG matériel ESP32
        esp_fill_random(random_bytes, length);
    } else {
        // Utiliser mbedTLS DRBG
        if (!g_entropy_initialized) {
            return ESP32_CRYPTO_ERROR_ENTROPY_FAILED;
        }
        
        int ret = mbedtls_ctr_drbg_random(&g_ctr_drbg, random_bytes, length);
        if (ret != 0) {
            ESP_LOGE(TAG, "Échec génération aléatoire: -0x%04x", -ret);
            g_crypto_info.error_count++;
            return ESP32_CRYPTO_ERROR_ENTROPY_FAILED;
        }
    }
    
