LeZelote01/SecureIoT-VIF/components/secure_element/esp32_crypto_manager.c
    g_crypto_info.operation_count++;
    g_crypto_info.last_operation_time = esp_timer_get_time();
    
    ESP_LOGD(TAG, "Génération aléatoire réussie");
    return ESP32_CRYPTO_SUCCESS;
}

esp32_crypto_result_t esp32_crypto_sha256(const uint8_t* data, size_t data_length, uint8_t* hash) {
    if (!g_crypto_initialized || data == NULL || hash == NULL || data_length == 0) {
        return ESP32_CRYPTO_ERROR_INVALID_PARAM;
    }
    
    ESP_LOGD(TAG, "Calcul SHA-256 sur %zu bytes...", data_length);
    
    mbedtls_sha256_context ctx;
    mbedtls_sha256_init(&ctx);
    
    esp32_crypto_result_t result = ESP32_CRYPTO_SUCCESS;
    
    do {
        int ret = mbedtls_sha256_starts(&ctx, 0); // 0 = SHA-256 (not SHA-224)
        if (ret != 0) {
            ESP_LOGE(TAG, "Échec initialisation SHA-256: -0x%04x", -ret);
            result = ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
            break;
        }
        
        ret = mbedtls_sha256_update(&ctx, data, data_length);
        if (ret != 0) {
            ESP_LOGE(TAG, "Échec update SHA-256: -0x%04x", -ret);
            result = ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
            break;
        }
        
        ret = mbedtls_sha256_finish(&ctx, hash);
        if (ret != 0) {
            ESP_LOGE(TAG, "Échec finalisation SHA-256: -0x%04x", -ret);
            result = ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
            break;
        }
        
        ESP_LOGD(TAG, "SHA-256 calculé avec succès");
        g_crypto_info.operation_count++;
        
    } while (0);
    
    mbedtls_sha256_free(&ctx);
    g_crypto_info.last_operation_time = esp_timer_get_time();
    
    return result;
}

esp32_crypto_result_t esp32_crypto_ecdsa_sign(uint8_t key_id, const uint8_t* message_hash, uint8_t* signature) {
    if (!g_crypto_initialized || key_id >= 4 || message_hash == NULL || signature == NULL) {
        return ESP32_CRYPTO_ERROR_INVALID_PARAM;
    }
    
    if (!g_key_slots[key_id].is_in_efuse || g_key_slots[key_id].key_type != 1) {
        ESP_LOGE(TAG, "Clé %d non disponible pour signature", key_id);
        return ESP32_CRYPTO_ERROR_INVALID_PARAM;
    }
    
    ESP_LOGI(TAG, "Signature ECDSA avec clé slot %d...", key_id);
    
    // Pour la simulation, nous générons une signature "factice" mais cohérente
    // En production, ceci utiliserait la clé privée stockée en eFuse
    
    mbedtls_ecdsa_context ecdsa_ctx;
    mbedtls_mpi r, s;
    
    mbedtls_ecdsa_init(&ecdsa_ctx);
    mbedtls_mpi_init(&r);
    mbedtls_mpi_init(&s);
    
    esp32_crypto_result_t result = ESP32_CRYPTO_SUCCESS;
    
    do {
        // Charger la courbe P-256
        int ret = mbedtls_ecp_group_load(&ecdsa_ctx.grp, MBEDTLS_ECP_DP_SECP256R1);
        if (ret != 0) {
            result = ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
            break;
        }
        
        // Générer une clé temporaire pour la démo (en production: utiliser eFuse)
        ret = mbedtls_ecp_gen_keypair(&ecdsa_ctx.grp, &ecdsa_ctx.d, &ecdsa_ctx.Q,
                                      mbedtls_ctr_drbg_random, &g_ctr_drbg);
        if (ret != 0) {
            result = ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
            break;
        }
        
        // Signer le hash
        ret = mbedtls_ecdsa_sign(&ecdsa_ctx.grp, &r, &s, &ecdsa_ctx.d, message_hash, 32,
                                 mbedtls_ctr_drbg_random, &g_ctr_drbg);
        if (ret != 0) {
            ESP_LOGE(TAG, "Échec signature ECDSA: -0x%04x", -ret);
            result = ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
            break;
        }
        
        // Encoder la signature (r || s)
        ret = mbedtls_mpi_write_binary(&r, signature, 32);
        if (ret != 0) {
            result = ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
            break;
        }
        
        ret = mbedtls_mpi_write_binary(&s, signature + 32, 32);
        if (ret != 0) {
            result = ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
            break;
        }
        
        g_key_slots[key_id].usage_count++;
        g_crypto_info.operation_count++;
        ESP_LOGI(TAG, "Signature ECDSA générée avec succès");
        
    } while (0);
    
    mbedtls_mpi_free(&s);
    mbedtls_mpi_free(&r);
    mbedtls_ecdsa_free(&ecdsa_ctx);
    
    g_crypto_info.last_operation_time = esp_timer_get_time();
    return result;
}

esp32_crypto_result_t esp32_crypto_ecdsa_verify(const uint8_t* public_key, const uint8_t* message_hash, const uint8_t* signature) {
    if (!g_crypto_initialized || public_key == NULL || message_hash == NULL || signature == NULL) {
        return ESP32_CRYPTO_ERROR_INVALID_PARAM;
    }
    
    ESP_LOGD(TAG, "Vérification signature ECDSA...");
    
    mbedtls_ecdsa_context ecdsa_ctx;
    mbedtls_mpi r, s;
    
    mbedtls_ecdsa_init(&ecdsa_ctx);
    mbedtls_mpi_init(&r);
    mbedtls_mpi_init(&s);
    
    esp32_crypto_result_t result = ESP32_CRYPTO_SUCCESS;
    
    do {
        // Charger la courbe P-256
        int ret = mbedtls_ecp_group_load(&ecdsa_ctx.grp, MBEDTLS_ECP_DP_SECP256R1);
        if (ret != 0) {
            result = ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
            break;
        }
        
        // Charger la clé publique
        ret = mbedtls_ecp_point_read_binary(&ecdsa_ctx.grp, &ecdsa_ctx.Q, public_key, 65);
        if (ret != 0) {
            ESP_LOGE(TAG, "Échec chargement clé publique: -0x%04x", -ret);
            result = ESP32_CRYPTO_ERROR_INVALID_PARAM;
            break;
        }
        
        // Charger la signature (r || s)
        ret = mbedtls_mpi_read_binary(&r, signature, 32);
        if (ret != 0) {
            result = ESP32_CRYPTO_ERROR_INVALID_PARAM;
            break;
        }
        
        ret = mbedtls_mpi_read_binary(&s, signature + 32, 32);
        if (ret != 0) {
            result = ESP32_CRYPTO_ERROR_INVALID_PARAM;
            break;
        }
        
        // Vérifier la signature
        ret = mbedtls_ecdsa_verify(&ecdsa_ctx.grp, message_hash, 32, &ecdsa_ctx.Q, &r, &s);
        if (ret != 0) {
            ESP_LOGW(TAG, "Signature ECDSA invalide: -0x%04x", -ret);
            result = ESP32_CRYPTO_ERROR_VERIFICATION_FAILED;
            break;
        }
        
        ESP_LOGD(TAG, "Signature ECDSA valide");
        g_crypto_info.operation_count++;
        
    } while (0);
    
