LeZelote01/SecureIoT-VIF/components/secure_element/esp32_crypto_manager.c
    mbedtls_mpi_free(&s);
    mbedtls_mpi_free(&r);
    mbedtls_ecdsa_free(&ecdsa_ctx);
    
    g_crypto_info.last_operation_time = esp_timer_get_time();
    return result;
}

esp32_crypto_result_t esp32_crypto_perform_attestation(const uint8_t* challenge, size_t challenge_size, 
                                                        esp32_attestation_t* attestation) {
    if (!g_crypto_initialized || challenge == NULL || attestation == NULL || challenge_size != 32) {
        return ESP32_CRYPTO_ERROR_INVALID_PARAM;
    }
    
    ESP_LOGI(TAG, "Exécution attestation ESP32...");
    
    memset(attestation, 0, sizeof(esp32_attestation_t));
    
    // Copier le challenge
    memcpy(attestation->challenge, challenge, challenge_size);
    
    // Ajouter l'ID du dispositif
    memcpy(attestation->device_id, g_crypto_info.device_id, ESP32_SERIAL_NUMBER_SIZE);
    
    // Ajouter timestamp et boot count
    attestation->timestamp = (uint32_t)(esp_timer_get_time() / 1000000); // Secondes
    attestation->boot_count = g_crypto_info.operation_count; // Approximation
    
    // Créer le message à signer (challenge + device_id + timestamp)
    uint8_t message_to_sign[32 + 6 + 4];
    memcpy(message_to_sign, challenge, 32);
    memcpy(message_to_sign + 32, g_crypto_info.device_id, 6);
    memcpy(message_to_sign + 38, &attestation->timestamp, 4);
    
    // Calculer le hash du message
    uint8_t message_hash[32];
    esp32_crypto_result_t result = esp32_crypto_sha256(message_to_sign, sizeof(message_to_sign), message_hash);
    if (result != ESP32_CRYPTO_SUCCESS) {
        return result;
    }
    
    // Signer avec la clé d'attestation (slot 1)
    result = esp32_crypto_ecdsa_sign(1, message_hash, attestation->response);
    if (result != ESP32_CRYPTO_SUCCESS) {
        ESP_LOGE(TAG, "Échec signature attestation");
        return result;
    }
    
    // Générer un certificat auto-signé simple (pour la démo)
    snprintf((char*)attestation->device_cert, ESP32_CERTIFICATE_SIZE,
             "-----BEGIN CERTIFICATE-----\n"
             "SecureIoT-VIF ESP32 Device Certificate\n"
             "Device ID: %02X:%02X:%02X:%02X:%02X:%02X\n"
             "Timestamp: %u\n"
             "Secure Boot: %s\n"
             "Flash Encryption: %s\n"
             "-----END CERTIFICATE-----\n",
             g_crypto_info.device_id[0], g_crypto_info.device_id[1], g_crypto_info.device_id[2],
             g_crypto_info.device_id[3], g_crypto_info.device_id[4], g_crypto_info.device_id[5],
             attestation->timestamp,
             g_crypto_info.secure_boot_enabled ? "Enabled" : "Disabled",
             g_crypto_info.flash_encryption_enabled ? "Enabled" : "Disabled");
    
    attestation->is_valid = true;
    g_crypto_info.operation_count++;
    
    ESP_LOGI(TAG, "Attestation ESP32 générée avec succès");
    return ESP32_CRYPTO_SUCCESS;
}

// ================================
// Fonctions utilitaires
// ================================

const char* esp32_crypto_error_to_string(esp32_crypto_result_t error) {
    switch (error) {
        case ESP32_CRYPTO_SUCCESS: return "Succès";
        case ESP32_CRYPTO_ERROR_INVALID_PARAM: return "Paramètre invalide";
        case ESP32_CRYPTO_ERROR_NOT_INITIALIZED: return "Non initialisé";
        case ESP32_CRYPTO_ERROR_MEMORY: return "Erreur mémoire";
        case ESP32_CRYPTO_ERROR_EFUSE_PROGRAMMING: return "Erreur programmation eFuse";
        case ESP32_CRYPTO_ERROR_VERIFICATION_FAILED: return "Vérification échouée";
        case ESP32_CRYPTO_ERROR_EXECUTION_FAILED: return "Exécution échouée";
        case ESP32_CRYPTO_ERROR_ENTROPY_FAILED: return "Erreur entropie";
        case ESP32_CRYPTO_ERROR_KEY_GENERATION: return "Erreur génération clé";
        case ESP32_CRYPTO_ERROR_FLASH_ENCRYPTION: return "Erreur chiffrement flash";
        case ESP32_CRYPTO_ERROR_SECURE_BOOT: return "Erreur secure boot";
        default: return "Erreur inconnue";
    }
}

void esp32_crypto_print_device_info(void) {
    if (!g_crypto_initialized) {
        ESP_LOGW(TAG, "Gestionnaire crypto non initialisé");
        return;
    }
    
    ESP_LOGI(TAG, "=== Informations Crypto ESP32 ===");
    ESP_LOGI(TAG, "Device ID: %02X:%02X:%02X:%02X:%02X:%02X",
             g_crypto_info.device_id[0], g_crypto_info.device_id[1], g_crypto_info.device_id[2],
             g_crypto_info.device_id[3], g_crypto_info.device_id[4], g_crypto_info.device_id[5]);
    ESP_LOGI(TAG, "Chip Revision: %d", g_crypto_info.chip_revision);
    ESP_LOGI(TAG, "Secure Boot: %s", g_crypto_info.secure_boot_enabled ? "Activé" : "Désactivé");
    ESP_LOGI(TAG, "Flash Encryption: %s", g_crypto_info.flash_encryption_enabled ? "Activé" : "Désactivé");
    ESP_LOGI(TAG, "État: %d", g_crypto_info.state);
    ESP_LOGI(TAG, "Opérations: %d", g_crypto_info.operation_count);
    ESP_LOGI(TAG, "Erreurs: %d", g_crypto_info.error_count);
    ESP_LOGI(TAG, "==============================");
}

esp32_crypto_result_t esp32_crypto_self_test(void) {
    if (!g_crypto_initialized) {
        return ESP32_CRYPTO_ERROR_NOT_INITIALIZED;
    }
    
    ESP_LOGI(TAG, "=== Démarrage Auto-test Crypto ESP32 ===");
    
    // Test 1: Génération aléatoire
    ESP_LOGI(TAG, "Test 1: Génération aléatoire...");
    uint8_t random1[32], random2[32];
    esp32_crypto_result_t result = esp32_crypto_generate_random(random1, sizeof(random1));
    if (result != ESP32_CRYPTO_SUCCESS) {
        ESP_LOGE(TAG, "❌ Test génération aléatoire échoué");
        return result;
    }
    
    result = esp32_crypto_generate_random(random2, sizeof(random2));
    if (result != ESP32_CRYPTO_SUCCESS || memcmp(random1, random2, 32) == 0) {
        ESP_LOGE(TAG, "❌ Test génération aléatoire échoué (identiques)");
        return ESP32_CRYPTO_ERROR_ENTROPY_FAILED;
    }
    ESP_LOGI(TAG, "✅ Test génération aléatoire réussi");
    
    // Test 2: Hash SHA-256
    ESP_LOGI(TAG, "Test 2: Hash SHA-256...");
    uint8_t test_data[] = "SecureIoT-VIF ESP32 Test";
    uint8_t hash1[32], hash2[32];
    
    result = esp32_crypto_sha256(test_data, strlen((char*)test_data), hash1);
    if (result != ESP32_CRYPTO_SUCCESS) {
        ESP_LOGE(TAG, "❌ Test SHA-256 échoué");
        return result;
    }
    
