LeZelote01/SecureIoT-VIF/components/secure_element/esp32_crypto_manager.c
    result = esp32_crypto_sha256(test_data, strlen((char*)test_data), hash2);
    if (result != ESP32_CRYPTO_SUCCESS || memcmp(hash1, hash2, 32) != 0) {
        ESP_LOGE(TAG, "❌ Test SHA-256 échoué (incohérent)");
        return ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
    }
    ESP_LOGI(TAG, "✅ Test SHA-256 réussi");
    
    // Test 3: Génération de clé ECDSA
    ESP_LOGI(TAG, "Test 3: Génération clé ECDSA...");
    uint8_t public_key[65];
    result = esp32_crypto_generate_ecdsa_keypair(0, public_key);
    if (result != ESP32_CRYPTO_SUCCESS) {
        ESP_LOGE(TAG, "❌ Test génération clé ECDSA échoué");
        return result;
    }
    ESP_LOGI(TAG, "✅ Test génération clé ECDSA réussi");
    
    // Test 4: Signature et vérification
    ESP_LOGI(TAG, "Test 4: Signature et vérification ECDSA...");
    uint8_t signature[64];
    result = esp32_crypto_ecdsa_sign(0, hash1, signature);
    if (result != ESP32_CRYPTO_SUCCESS) {
        ESP_LOGE(TAG, "❌ Test signature ECDSA échoué");
        return result;
    }
    
    result = esp32_crypto_ecdsa_verify(public_key, hash1, signature);
    if (result != ESP32_CRYPTO_SUCCESS) {
        ESP_LOGE(TAG, "❌ Test vérification ECDSA échoué");
        return result;
    }
    ESP_LOGI(TAG, "✅ Test signature/vérification ECDSA réussi");
    
    // Test 5: Attestation complète
    ESP_LOGI(TAG, "Test 5: Attestation complète...");
    uint8_t challenge[32];
    esp32_crypto_generate_random(challenge, sizeof(challenge));
    
    esp32_attestation_t attestation;
    result = esp32_crypto_perform_attestation(challenge, sizeof(challenge), &attestation);
    if (result != ESP32_CRYPTO_SUCCESS || !attestation.is_valid) {
        ESP_LOGE(TAG, "❌ Test attestation échoué");
        return result;
    }
    ESP_LOGI(TAG, "✅ Test attestation réussi");
    
    ESP_LOGI(TAG, "=== 🎉 Auto-test Crypto ESP32 RÉUSSI ===");
    return ESP32_CRYPTO_SUCCESS;
}

esp32_crypto_result_t esp32_crypto_get_statistics(uint32_t* operations_count, uint32_t* error_count, 
                                                   uint64_t* last_operation_time) {
    if (!g_crypto_initialized) {
        return ESP32_CRYPTO_ERROR_NOT_INITIALIZED;
    }
    
    if (operations_count) *operations_count = g_crypto_info.operation_count;
    if (error_count) *error_count = g_crypto_info.error_count;
    if (last_operation_time) *last_operation_time = g_crypto_info.last_operation_time;
    
    return ESP32_CRYPTO_SUCCESS;
}

esp32_crypto_result_t esp32_crypto_get_device_id(uint8_t* device_id) {
    if (!g_crypto_initialized || device_id == NULL) {
        return ESP32_CRYPTO_ERROR_INVALID_PARAM;
    }
    
    memcpy(device_id, g_crypto_info.device_id, ESP32_SERIAL_NUMBER_SIZE);
    return ESP32_CRYPTO_SUCCESS;
}

// Fonctions de compatibilité supplémentaires
esp32_crypto_result_t esp32_crypto_verify_integrity(void) {
    return esp32_crypto_health_check();
}

esp32_crypto_result_t esp32_crypto_update_heartbeat(uint32_t counter) {
    ESP_LOGD(TAG, "Heartbeat update: %u", counter);
    g_crypto_info.last_operation_time = esp_timer_get_time();
    return ESP32_CRYPTO_SUCCESS;
}

esp32_crypto_result_t esp32_crypto_store_emergency_state(void) {
    ESP_LOGI(TAG, "Stockage état d'urgence...");
    
    nvs_handle_t nvs_handle;
    esp_err_t ret = nvs_open("emergency", NVS_READWRITE, &nvs_handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Erreur ouverture NVS: %s", esp_err_to_name(ret));
        return ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
    }
    
    uint32_t emergency_data = g_crypto_info.operation_count;
    ret = nvs_set_u32(nvs_handle, "state", emergency_data);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Erreur écriture NVS: %s", esp_err_to_name(ret));
        nvs_close(nvs_handle);
        return ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
    }
    
    ret = nvs_commit(nvs_handle);
    nvs_close(nvs_handle);
    
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Erreur commit NVS: %s", esp_err_to_name(ret));
        return ESP32_CRYPTO_ERROR_EXECUTION_FAILED;
    }
    
    ESP_LOGI(TAG, "État d'urgence stocké avec succès");
    return ESP32_CRYPTO_SUCCESS;
}